CFD-Computational Heat Transfer/03_OpenFOAM/Lid_Driven_Cavity/Re_1000/Case_Setup/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* kinematic viscosity nu = 1/Re */
transportModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] 0.001; // Re = 1000 if U=L=1


// ************************************************************************* //
